Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/fcr.h
#define FCR_INTENCLR_SERR_Pos                 _UINT32_(0)                                          /* (FCR_INTENCLR) Flash SEC Interrupt Clear Enable Position */
#define FCR_INTENCLR_SERR_Msk                 (_UINT32_(0x1) << FCR_INTENCLR_SERR_Pos)             /* (FCR_INTENCLR) Flash SEC Interrupt Clear Enable Mask */
#define FCR_INTENCLR_SERR(value)              (FCR_INTENCLR_SERR_Msk & (_UINT32_(value) << FCR_INTENCLR_SERR_Pos)) /* Assigment of value for SERR in the FCR_INTENCLR register */
#define FCR_INTENCLR_DERR_Pos                 _UINT32_(1)                                          /* (FCR_INTENCLR) ECC Double Error Detected Clear Enable Position */
#define FCR_INTENCLR_DERR_Msk                 (_UINT32_(0x1) << FCR_INTENCLR_DERR_Pos)             /* (FCR_INTENCLR) ECC Double Error Detected Clear Enable Mask */
#define FCR_INTENCLR_DERR(value)              (FCR_INTENCLR_DERR_Msk & (_UINT32_(value) << FCR_INTENCLR_DERR_Pos)) /* Assigment of value for DERR in the FCR_INTENCLR register */
#define FCR_INTENCLR_CRCDONE_Pos              _UINT32_(8)                                          /* (FCR_INTENCLR) CRC Calculation Done Clear Enable Position */
#define FCR_INTENCLR_CRCDONE_Msk              (_UINT32_(0x1) << FCR_INTENCLR_CRCDONE_Pos)          /* (FCR_INTENCLR) CRC Calculation Done Clear Enable Mask */
#define FCR_INTENCLR_CRCDONE(value)           (FCR_INTENCLR_CRCDONE_Msk & (_UINT32_(value) << FCR_INTENCLR_CRCDONE_Pos)) /* Assigment of value for CRCDONE in the FCR_INTENCLR register */
#define FCR_INTENCLR_CRCERR_Pos               _UINT32_(9)                                          /* (FCR_INTENCLR) CRC Error Clear Enable Position */
#define FCR_INTENCLR_CRCERR_Msk               (_UINT32_(0x1) << FCR_INTENCLR_CRCERR_Pos)           /* (FCR_INTENCLR) CRC Error Clear Enable Mask */
#define FCR_INTENCLR_CRCERR(value)            (FCR_INTENCLR_CRCERR_Msk & (_UINT32_(value) << FCR_INTENCLR_CRCERR_Pos)) /* Assigment of value for CRCERR in the FCR_INTENCLR register */
#define FCR_INTENCLR_FLTCAP_Pos               _UINT32_(16)                                         /* (FCR_INTENCLR) ECC Fault Capture Clear Enable Position */
#define FCR_INTENCLR_FLTCAP_Msk               (_UINT32_(0x1) << FCR_INTENCLR_FLTCAP_Pos)           /* (FCR_INTENCLR) ECC Fault Capture Clear Enable Mask */
#define FCR_INTENCLR_FLTCAP(value)            (FCR_INTENCLR_FLTCAP_Msk & (_UINT32_(value) << FCR_INTENCLR_FLTCAP_Pos)) /* Assigment of value for FLTCAP in the FCR_INTENCLR register */
#define FCR_INTENCLR_Msk                      _UINT32_(0x00010303)                                 /* (FCR_INTENCLR) Register Mask  */


/* -------- FCR_INTENSET : (FCR Offset: 0x0C) (R/W 32) Interrupt Enable SET Register -------- */
#define FCR_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_INTENSET) Interrupt Enable SET Register  Reset Value */

#define FCR_INTENSET_SERR_Pos                 _UINT32_(0)                                          /* (FCR_INTENSET) Flash Single Error Corrected Set Enable Position */
#define FCR_INTENSET_SERR_Msk                 (_UINT32_(0x1) << FCR_INTENSET_SERR_Pos)             /* (FCR_INTENSET) Flash Single Error Corrected Set Enable Mask */
#define FCR_INTENSET_SERR(value)              (FCR_INTENSET_SERR_Msk & (_UINT32_(value) << FCR_INTENSET_SERR_Pos)) /* Assigment of value for SERR in the FCR_INTENSET register */
#define FCR_INTENSET_DERR_Pos                 _UINT32_(1)                                          /* (FCR_INTENSET) ECC Double Error Detected Set Enable Position */
#define FCR_INTENSET_DERR_Msk                 (_UINT32_(0x1) << FCR_INTENSET_DERR_Pos)             /* (FCR_INTENSET) ECC Double Error Detected Set Enable Mask */
#define FCR_INTENSET_DERR(value)              (FCR_INTENSET_DERR_Msk & (_UINT32_(value) << FCR_INTENSET_DERR_Pos)) /* Assigment of value for DERR in the FCR_INTENSET register */
#define FCR_INTENSET_CRCDONE_Pos              _UINT32_(8)                                          /* (FCR_INTENSET) CRC Calculation Done Set Enable Position */
#define FCR_INTENSET_CRCDONE_Msk              (_UINT32_(0x1) << FCR_INTENSET_CRCDONE_Pos)          /* (FCR_INTENSET) CRC Calculation Done Set Enable Mask */
#define FCR_INTENSET_CRCDONE(value)           (FCR_INTENSET_CRCDONE_Msk & (_UINT32_(value) << FCR_INTENSET_CRCDONE_Pos)) /* Assigment of value for CRCDONE in the FCR_INTENSET register */
#define FCR_INTENSET_CRCERR_Pos               _UINT32_(9)                                          /* (FCR_INTENSET) CRC Error Interrupt Set Enable Position */
#define FCR_INTENSET_CRCERR_Msk               (_UINT32_(0x1) << FCR_INTENSET_CRCERR_Pos)           /* (FCR_INTENSET) CRC Error Interrupt Set Enable Mask */
#define FCR_INTENSET_CRCERR(value)            (FCR_INTENSET_CRCERR_Msk & (_UINT32_(value) << FCR_INTENSET_CRCERR_Pos)) /* Assigment of value for CRCERR in the FCR_INTENSET register */
#define FCR_INTENSET_FLTCAP_Pos               _UINT32_(16)                                         /* (FCR_INTENSET) ECC Fault Capture Interrupt Set Enable Position */
#define FCR_INTENSET_FLTCAP_Msk               (_UINT32_(0x1) << FCR_INTENSET_FLTCAP_Pos)           /* (FCR_INTENSET) ECC Fault Capture Interrupt Set Enable Mask */
#define FCR_INTENSET_FLTCAP(value)            (FCR_INTENSET_FLTCAP_Msk & (_UINT32_(value) << FCR_INTENSET_FLTCAP_Pos)) /* Assigment of value for FLTCAP in the FCR_INTENSET register */
#define FCR_INTENSET_Msk                      _UINT32_(0x00010303)                                 /* (FCR_INTENSET) Register Mask  */


/* -------- FCR_INTFLAG : (FCR Offset: 0x10) (R/W 32) Interrupt Flag Register -------- */
#define FCR_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_INTFLAG) Interrupt Flag Register  Reset Value */

#define FCR_INTFLAG_SERR_Pos                  _UINT32_(0)                                          /* (FCR_INTFLAG) Flash Single Error Corrected Flag Position */
#define FCR_INTFLAG_SERR_Msk                  (_UINT32_(0x1) << FCR_INTFLAG_SERR_Pos)              /* (FCR_INTFLAG) Flash Single Error Corrected Flag Mask */
#define FCR_INTFLAG_SERR(value)               (FCR_INTFLAG_SERR_Msk & (_UINT32_(value) << FCR_INTFLAG_SERR_Pos)) /* Assigment of value for SERR in the FCR_INTFLAG register */
#define FCR_INTFLAG_DERR_Pos                  _UINT32_(1)                                          /* (FCR_INTFLAG) ECC Double Error Detected Flag Position */
#define FCR_INTFLAG_DERR_Msk                  (_UINT32_(0x1) << FCR_INTFLAG_DERR_Pos)              /* (FCR_INTFLAG) ECC Double Error Detected Flag Mask */
#define FCR_INTFLAG_DERR(value)               (FCR_INTFLAG_DERR_Msk & (_UINT32_(value) << FCR_INTFLAG_DERR_Pos)) /* Assigment of value for DERR in the FCR_INTFLAG register */
#define FCR_INTFLAG_CRCDONE_Pos               _UINT32_(8)                                          /* (FCR_INTFLAG) CRC Calculation Done Flag Position */
#define FCR_INTFLAG_CRCDONE_Msk               (_UINT32_(0x1) << FCR_INTFLAG_CRCDONE_Pos)           /* (FCR_INTFLAG) CRC Calculation Done Flag Mask */
#define FCR_INTFLAG_CRCDONE(value)            (FCR_INTFLAG_CRCDONE_Msk & (_UINT32_(value) << FCR_INTFLAG_CRCDONE_Pos)) /* Assigment of value for CRCDONE in the FCR_INTFLAG register */
#define FCR_INTFLAG_CRCERR_Pos                _UINT32_(9)                                          /* (FCR_INTFLAG) CRC Error Flag Position */
#define FCR_INTFLAG_CRCERR_Msk                (_UINT32_(0x1) << FCR_INTFLAG_CRCERR_Pos)            /* (FCR_INTFLAG) CRC Error Flag Mask */
#define FCR_INTFLAG_CRCERR(value)             (FCR_INTFLAG_CRCERR_Msk & (_UINT32_(value) << FCR_INTFLAG_CRCERR_Pos)) /* Assigment of value for CRCERR in the FCR_INTFLAG register */
#define FCR_INTFLAG_FLTCAP_Pos                _UINT32_(16)                                         /* (FCR_INTFLAG) ECC Fault Capture Flag Position */
#define FCR_INTFLAG_FLTCAP_Msk                (_UINT32_(0x1) << FCR_INTFLAG_FLTCAP_Pos)            /* (FCR_INTFLAG) ECC Fault Capture Flag Mask */
#define FCR_INTFLAG_FLTCAP(value)             (FCR_INTFLAG_FLTCAP_Msk & (_UINT32_(value) << FCR_INTFLAG_FLTCAP_Pos)) /* Assigment of value for FLTCAP in the FCR_INTFLAG register */
#define FCR_INTFLAG_Msk                       _UINT32_(0x00010303)                                 /* (FCR_INTFLAG) Register Mask  */


